app/controllers/api/images_controller.rb

    def upload
      puts "---------------- Uploading ----------------"
      image_log = ImageLog.create!(uploaded_at: Time.zone.now)
---
INSERT INTO "image_logs" ("uploaded_at", "created_at", "updated_at", "lock_version") VALUES ($1, $2, $3, $4) RETURNING "id"  [["uploaded_at", "2020-10-22 00:20:35.335334"], ["created_at", "2020-10-22 00:20:35.340903"], ["updated_at", "2020-10-22 00:20:35.340903"], ["lock_version", 0]]